
Вам дан словарь per_cent с распределением процентных ставок по вкладам 
в различных банках таким образом, что ключ — название банка, 
значение — процент. Напишите программу, в результате которой будет сформирован 
список deposit значений — накопленные средства за год вклада в каждом из банков. 
На вход программы с клавиатуры вводится сумма money, которую человек планирует положить под проценты.





per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
money = int(input('Введите сумму вклада:'))
depozit = (money*per_cent.get('ТКБ')/100,money*per_cent.get('СКБ')/100,money*per_cent.get('ВТБ')/100,money*per_cent.get('СБЕР')/100)
depozit = list(map(round,depozit))
print('Список депозита от вклада,в каждом Банке',depozit)
max_number = max(depozit)
print('Максимальная сумма, которую вы можете заработать:',max_number)

for key, value in per_cent.items():
    print('Банк/годовая процентная ставка от вклада',key,value)

inverse = [(value, key) for key, value in per_cent.items()]
print('Банк, который предоставляет максимальную ставку:',max(inverse)[1]) #вытаскиваем ключь с максимальным значением
inverse = [(value, key) for key, value in per_cent.items()]
print('Мах ставка которую предоставляет Банк',max(inverse)[0],'% годовых') #вытаскиваем максимальное значение ключа

print('Банк',max(inverse)[1],'Предоставляет максимальную годовую ставку от вашего вклада:',max_number,'рублей')


max_value = per_cent[max(per_cent, key= per_cent.get)]
print(max_value) #вытаскиваем максимальное значение ключа

max_key = max(per_cent , key=lambda k: per_cent [k])
print(max_key) # ключ с мамксимальным значением

print('Максимальная сумма, которую вы можете заработать:',max_number,'рублей в Банке',max_key,'со ставкой ',max_value,'% годовых')
